benchmarks/results/2026-08-29-709-diagnosis/wrk-guest-loopback/wrk-loopback-off-close.txt
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.72ms  735.40us  14.92ms   75.10%
    Req/Sec     1.68k    60.80     1.77k    92.50%
  Latency Distribution
     50%    4.65ms
     75%    5.09ms
     90%    5.56ms
     99%    7.17ms
  100230 requests in 15.01s, 53.72MB read
Requests/sec:   6679.23
Transfer/sec:      3.58MB