benchmarks/results/2026-08-29-709-diagnosis/wrk-guest-loopback/wrk-loopback-off-keepalive.txt
Running 15s test @ http://127.0.0.1:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.29ms  556.46us  11.16ms   74.24%
    Req/Sec     1.87k    51.98     1.95k    92.17%
  Latency Distribution
     50%    4.24ms
     75%    4.59ms
     90%    4.94ms
     99%    6.07ms
  111738 requests in 15.01s, 60.42MB read
Requests/sec:   7446.49
Transfer/sec:      4.03MB